/*1. Дано два масиви: А[M] і B[N] (M і N вводяться з клавіатури). 
Необхідно створити третій масив мінімально можливого розміру, 
у якому потрібно зібрати елементи масиву A, які не включаються до масиву B, без повторень.
2. Дано два масиви: А[M] і B[N] (M і N вводяться з клавіатури). 
Необхідно створити третій масив мінімально можливого розміру, 
у якому потрібно зібрати елементи масивів A і B, які не є загальними для них, без повторень.
3. Дано два масиви: А[M] і B[N] (M і N вводяться з клавіатури). 
Необхідно створити третій масив мінімально можливого розміру, 
у якому потрібно зібрати елементи обох масивів.
4. Дано масив: А[M] (M вводиться з клавіатури). 
Необхідно видалити з масиву парні або непарні значення.
Користувач вводить дані в масив, а також за допомогою меню вирішує, що потрібно видалити.*/

#include<iostream>
#include "Zagalne.h"

int main() {
	Random;
	int n;
	Vubir_zadachi();
	Vvod(n);
	Swich_zadach(n);
	Show('\n');
}
