/*1. Дано два масиви: А[M] і B[N] (M і N вводяться з клавіатури).
Необхідно створити третій масив мінімально можливого розміру,
у якому потрібно зібрати елементи масиву A, які не включаються до масиву B, без повторень.
2. Дано два масиви: А[M] і B[N] (M і N вводяться з клавіатури).
Необхідно створити третій масив мінімально можливого розміру,
у якому потрібно зібрати елементи масивів A і B, які не є загальними для них, без повторень.
3. Дано два масиви: А[M] і B[N] (M і N вводяться з клавіатури).
Необхідно створити третій масив мінімально можливого розміру,
у якому потрібно зібрати елементи обох масивів.
4. Дано масив: А[M] (M вводиться з клавіатури).
Необхідно видалити з масиву парні або непарні значення.
Користувач вводить дані в масив, а також за допомогою меню вирішує, що потрібно видалити.*/
#pragma once
#define Vvod(a)std::cin >> a;
#define Show(a)std::cout << a;
#define Default default:std::cout << "Ne virno obranuy variant";
#define Random srand(time(NULL));

#include "Zadacha1.h"
//#include "Zadacha2.h"
//#include "Zadacha3.h"
//#include "Zadacha4.h"

void Vubir_zadachi();
void Swich_zadach(int &a);
void Masuv(int& a, int A[]);
void Show_masuv(int& a, int A[]);